yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al318a.h
#define WWDG_CR_T0               WWDG_CR_bit.T0
#define WWDG_CR_T1               WWDG_CR_bit.T1
#define WWDG_CR_T2               WWDG_CR_bit.T2
#define WWDG_CR_T3               WWDG_CR_bit.T3
#define WWDG_CR_T4               WWDG_CR_bit.T4
#define WWDG_CR_T5               WWDG_CR_bit.T5
#define WWDG_CR_T6               WWDG_CR_bit.T6
#define WWDG_CR_T7               WWDG_CR_bit.T7

#define WWDG_WR_W0               WWDG_WR_bit.W0
#define WWDG_WR_W1               WWDG_WR_bit.W1
#define WWDG_WR_W2               WWDG_WR_bit.W2
#define WWDG_WR_W3               WWDG_WR_bit.W3
#define WWDG_WR_W4               WWDG_WR_bit.W4
#define WWDG_WR_W5               WWDG_WR_bit.W5
#define WWDG_WR_W6               WWDG_WR_bit.W6
#define WWDG_WR_W7               WWDG_WR_bit.W7

#endif

/*-------------------------------------------------------------------------
 *      WWDG bit masks
 *-----------------------------------------------------------------------*/
#define MASK_WWDG_CR_T0          0x01
#define MASK_WWDG_CR_T1          0x02
#define MASK_WWDG_CR_T2          0x04
#define MASK_WWDG_CR_T3          0x08
#define MASK_WWDG_CR_T4          0x10
#define MASK_WWDG_CR_T5          0x20
#define MASK_WWDG_CR_T6          0x40
#define MASK_WWDG_CR_T7          0x80

#define MASK_WWDG_WR_W0          0x01
#define MASK_WWDG_WR_W1          0x02
#define MASK_WWDG_WR_W2          0x04
#define MASK_WWDG_WR_W3          0x08
#define MASK_WWDG_WR_W4          0x10
#define MASK_WWDG_WR_W5          0x20
#define MASK_WWDG_WR_W6          0x40
#define MASK_WWDG_WR_W7          0x80


/*-------------------------------------------------------------------------
 *      IWDG register definitions
 *-----------------------------------------------------------------------*/
/* IWDG key register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char KEY0        : 1;
  unsigned char KEY1        : 1;
  unsigned char KEY2        : 1;
  unsigned char KEY3        : 1;
  unsigned char KEY4        : 1;
  unsigned char KEY5        : 1;
  unsigned char KEY6        : 1;
  unsigned char KEY7        : 1;
} __BITS_IWDG_KR;
#endif
__IO_REG8_BIT(IWDG_KR,     0x50E0, __WRITE, __BITS_IWDG_KR);

/* IWDG prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PR          : 3;
} __BITS_IWDG_PR;
#endif
__IO_REG8_BIT(IWDG_PR,     0x50E1, __READ_WRITE, __BITS_IWDG_PR);

/* IWDG reload register */
__IO_REG8    (IWDG_RLR,    0x50E2, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      IWDG bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define IWDG_KR_KEY0             IWDG_KR_bit.KEY0
#define IWDG_KR_KEY1             IWDG_KR_bit.KEY1
#define IWDG_KR_KEY2             IWDG_KR_bit.KEY2
#define IWDG_KR_KEY3             IWDG_KR_bit.KEY3
#define IWDG_KR_KEY4             IWDG_KR_bit.KEY4
#define IWDG_KR_KEY5             IWDG_KR_bit.KEY5
#define IWDG_KR_KEY6             IWDG_KR_bit.KEY6
#define IWDG_KR_KEY7             IWDG_KR_bit.KEY7

#define IWDG_PR_PR               IWDG_PR_bit.PR

#endif

/*-------------------------------------------------------------------------
 *      IWDG bit masks
 *-----------------------------------------------------------------------*/
#define MASK_IWDG_KR_KEY0        0x01
#define MASK_IWDG_KR_KEY1        0x02
#define MASK_IWDG_KR_KEY2        0x04
#define MASK_IWDG_KR_KEY3        0x08
#define MASK_IWDG_KR_KEY4        0x10
#define MASK_IWDG_KR_KEY5        0x20
#define MASK_IWDG_KR_KEY6        0x40
#define MASK_IWDG_KR_KEY7        0x80

#define MASK_IWDG_PR_PR          0x07


/*-------------------------------------------------------------------------
 *      BEEP register definitions
 *-----------------------------------------------------------------------*/
/* BEEP control/status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MSR         : 1;
} __BITS_BEEP_CSR1;
#endif
__IO_REG8_BIT(BEEP_CSR1,   0x50F0, __READ_WRITE, __BITS_BEEP_CSR1);

/* BEEP control/status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BEEPDIV     : 5;
  unsigned char BEEPEN      : 1;
  unsigned char BEEPSEL     : 2;
} __BITS_BEEP_CSR2;
#endif
__IO_REG8_BIT(BEEP_CSR2,   0x50F3, __READ_WRITE, __BITS_BEEP_CSR2);


/*-------------------------------------------------------------------------
 *      BEEP bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define BEEP_CSR1_MSR            BEEP_CSR1_bit.MSR

#define BEEP_CSR2_BEEPDIV        BEEP_CSR2_bit.BEEPDIV
#define BEEP_CSR2_BEEPEN         BEEP_CSR2_bit.BEEPEN
#define BEEP_CSR2_BEEPSEL        BEEP_CSR2_bit.BEEPSEL

#endif

/*-------------------------------------------------------------------------
 *      BEEP bit masks
 *-----------------------------------------------------------------------*/
#define MASK_BEEP_CSR1_MSR       0x01

#define MASK_BEEP_CSR2_BEEPDIV   0x1F
#define MASK_BEEP_CSR2_BEEPEN    0x20
#define MASK_BEEP_CSR2_BEEPSEL   0xC0


/*-------------------------------------------------------------------------
 *      RTC register definitions
 *-----------------------------------------------------------------------*/
/* Time register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SU          : 4;
  unsigned char ST          : 4;
} __BITS_RTC_TR1;
#endif
__IO_REG8_BIT(RTC_TR1,     0x5140, __READ_WRITE, __BITS_RTC_TR1);

/* Time register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MNU         : 4;
  unsigned char MNT         : 4;
} __BITS_RTC_TR2;
#endif
__IO_REG8_BIT(RTC_TR2,     0x5141, __READ_WRITE, __BITS_RTC_TR2);

/* Time register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char HU          : 4;
  unsigned char HT          : 2;
  unsigned char PM          : 1;
} __BITS_RTC_TR3;
#endif
__IO_REG8_BIT(RTC_TR3,     0x5142, __READ_WRITE, __BITS_RTC_TR3);

