yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al318a.h
#define TIM3_CR1_CEN             TIM3_CR1_bit.CEN
#define TIM3_CR1_UDIS            TIM3_CR1_bit.UDIS
#define TIM3_CR1_URS             TIM3_CR1_bit.URS
#define TIM3_CR1_OPM             TIM3_CR1_bit.OPM
#define TIM3_CR1_DIR             TIM3_CR1_bit.DIR
#define TIM3_CR1_CMS             TIM3_CR1_bit.CMS
#define TIM3_CR1_ARPE            TIM3_CR1_bit.ARPE

#define TIM3_CR2_CCDS            TIM3_CR2_bit.CCDS
#define TIM3_CR2_MMS             TIM3_CR2_bit.MMS
#define TIM3_CR2_TI1S            TIM3_CR2_bit.TI1S

#define TIM3_SMCR_SMS            TIM3_SMCR_bit.SMS
#define TIM3_SMCR_TS             TIM3_SMCR_bit.TS
#define TIM3_SMCR_MSM            TIM3_SMCR_bit.MSM

#define TIM3_ETR_ETF             TIM3_ETR_bit.ETF
#define TIM3_ETR_ETPS            TIM3_ETR_bit.ETPS
#define TIM3_ETR_ECE             TIM3_ETR_bit.ECE
#define TIM3_ETR_ETP             TIM3_ETR_bit.ETP

#define TIM3_DER_UDE             TIM3_DER_bit.UDE
#define TIM3_DER_CC1DE           TIM3_DER_bit.CC1DE
#define TIM3_DER_CC2DE           TIM3_DER_bit.CC2DE

#define TIM3_IER_UIE             TIM3_IER_bit.UIE
#define TIM3_IER_CC1IE           TIM3_IER_bit.CC1IE
#define TIM3_IER_CC2IE           TIM3_IER_bit.CC2IE
#define TIM3_IER_TIE             TIM3_IER_bit.TIE
#define TIM3_IER_BIE             TIM3_IER_bit.BIE

#define TIM3_SR1_UIF             TIM3_SR1_bit.UIF
#define TIM3_SR1_CC1IF           TIM3_SR1_bit.CC1IF
#define TIM3_SR1_CC2IF           TIM3_SR1_bit.CC2IF
#define TIM3_SR1_TIF             TIM3_SR1_bit.TIF
#define TIM3_SR1_BIF             TIM3_SR1_bit.BIF

#define TIM3_SR2_CC1OF           TIM3_SR2_bit.CC1OF
#define TIM3_SR2_CC2OF           TIM3_SR2_bit.CC2OF

#define TIM3_EGR_UG              TIM3_EGR_bit.UG
#define TIM3_EGR_CC1G            TIM3_EGR_bit.CC1G
#define TIM3_EGR_CC2G            TIM3_EGR_bit.CC2G
#define TIM3_EGR_TG              TIM3_EGR_bit.TG
#define TIM3_EGR_BG              TIM3_EGR_bit.BG

#define TIM3_CCMR1_CC1S          TIM3_CCMR1_bit.CC1S
#define TIM3_CCMR1_OC1FE         TIM3_CCMR1_bit.OC1FE
#define TIM3_CCMR1_OC1PE         TIM3_CCMR1_bit.OC1PE
#define TIM3_CCMR1_OC1M          TIM3_CCMR1_bit.OC1M

#define TIM3_CCMR2_CC2S          TIM3_CCMR2_bit.CC2S
#define TIM3_CCMR2_OC2FE         TIM3_CCMR2_bit.OC2FE
#define TIM3_CCMR2_OC2PE         TIM3_CCMR2_bit.OC2PE
#define TIM3_CCMR2_OC2M          TIM3_CCMR2_bit.OC2M

#define TIM3_CCER1_CC1E          TIM3_CCER1_bit.CC1E
#define TIM3_CCER1_CC1P          TIM3_CCER1_bit.CC1P
#define TIM3_CCER1_CC2E          TIM3_CCER1_bit.CC2E
#define TIM3_CCER1_CC2P          TIM3_CCER1_bit.CC2P

#define TIM3_CNTRH_CNT8          TIM3_CNTRH_bit.CNT8
#define TIM3_CNTRH_CNT9          TIM3_CNTRH_bit.CNT9
#define TIM3_CNTRH_CNT10         TIM3_CNTRH_bit.CNT10
#define TIM3_CNTRH_CNT11         TIM3_CNTRH_bit.CNT11
#define TIM3_CNTRH_CNT12         TIM3_CNTRH_bit.CNT12
#define TIM3_CNTRH_CNT13         TIM3_CNTRH_bit.CNT13
#define TIM3_CNTRH_CNT14         TIM3_CNTRH_bit.CNT14
#define TIM3_CNTRH_CNT15         TIM3_CNTRH_bit.CNT15

#define TIM3_CNTRL_CNT0          TIM3_CNTRL_bit.CNT0
#define TIM3_CNTRL_CNT1          TIM3_CNTRL_bit.CNT1
#define TIM3_CNTRL_CNT2          TIM3_CNTRL_bit.CNT2
#define TIM3_CNTRL_CNT3          TIM3_CNTRL_bit.CNT3
#define TIM3_CNTRL_CNT4          TIM3_CNTRL_bit.CNT4
#define TIM3_CNTRL_CNT5          TIM3_CNTRL_bit.CNT5
#define TIM3_CNTRL_CNT6          TIM3_CNTRL_bit.CNT6
#define TIM3_CNTRL_CNT7          TIM3_CNTRL_bit.CNT7

#define TIM3_PSCR_PSC            TIM3_PSCR_bit.PSC

#define TIM3_ARRH_ARR8           TIM3_ARRH_bit.ARR8
#define TIM3_ARRH_ARR9           TIM3_ARRH_bit.ARR9
#define TIM3_ARRH_ARR10          TIM3_ARRH_bit.ARR10
#define TIM3_ARRH_ARR11          TIM3_ARRH_bit.ARR11
#define TIM3_ARRH_ARR12          TIM3_ARRH_bit.ARR12
#define TIM3_ARRH_ARR13          TIM3_ARRH_bit.ARR13
#define TIM3_ARRH_ARR14          TIM3_ARRH_bit.ARR14
#define TIM3_ARRH_ARR15          TIM3_ARRH_bit.ARR15

#define TIM3_ARRL_ARR0           TIM3_ARRL_bit.ARR0
#define TIM3_ARRL_ARR1           TIM3_ARRL_bit.ARR1
#define TIM3_ARRL_ARR2           TIM3_ARRL_bit.ARR2
#define TIM3_ARRL_ARR3           TIM3_ARRL_bit.ARR3
#define TIM3_ARRL_ARR4           TIM3_ARRL_bit.ARR4
#define TIM3_ARRL_ARR5           TIM3_ARRL_bit.ARR5
#define TIM3_ARRL_ARR6           TIM3_ARRL_bit.ARR6
#define TIM3_ARRL_ARR7           TIM3_ARRL_bit.ARR7

#define TIM3_CCR1H_CCR18         TIM3_CCR1H_bit.CCR18
#define TIM3_CCR1H_CCR19         TIM3_CCR1H_bit.CCR19
#define TIM3_CCR1H_CCR110        TIM3_CCR1H_bit.CCR110
#define TIM3_CCR1H_CCR111        TIM3_CCR1H_bit.CCR111
#define TIM3_CCR1H_CCR112        TIM3_CCR1H_bit.CCR112
#define TIM3_CCR1H_CCR113        TIM3_CCR1H_bit.CCR113
#define TIM3_CCR1H_CCR114        TIM3_CCR1H_bit.CCR114
#define TIM3_CCR1H_CCR115        TIM3_CCR1H_bit.CCR115

#define TIM3_CCR1L_CCR10         TIM3_CCR1L_bit.CCR10
#define TIM3_CCR1L_CCR11         TIM3_CCR1L_bit.CCR11
#define TIM3_CCR1L_CCR12         TIM3_CCR1L_bit.CCR12
#define TIM3_CCR1L_CCR13         TIM3_CCR1L_bit.CCR13
#define TIM3_CCR1L_CCR14         TIM3_CCR1L_bit.CCR14
#define TIM3_CCR1L_CCR15         TIM3_CCR1L_bit.CCR15
#define TIM3_CCR1L_CCR16         TIM3_CCR1L_bit.CCR16
#define TIM3_CCR1L_CCR17         TIM3_CCR1L_bit.CCR17

#define TIM3_CCR2H_CCR28         TIM3_CCR2H_bit.CCR28
#define TIM3_CCR2H_CCR29         TIM3_CCR2H_bit.CCR29
#define TIM3_CCR2H_CCR210        TIM3_CCR2H_bit.CCR210
#define TIM3_CCR2H_CCR211        TIM3_CCR2H_bit.CCR211
#define TIM3_CCR2H_CCR212        TIM3_CCR2H_bit.CCR212
#define TIM3_CCR2H_CCR213        TIM3_CCR2H_bit.CCR213
#define TIM3_CCR2H_CCR214        TIM3_CCR2H_bit.CCR214
#define TIM3_CCR2H_CCR215        TIM3_CCR2H_bit.CCR215

#define TIM3_CCR2L_CCR10         TIM3_CCR2L_bit.CCR10
#define TIM3_CCR2L_CCR11         TIM3_CCR2L_bit.CCR11
#define TIM3_CCR2L_CCR12         TIM3_CCR2L_bit.CCR12
#define TIM3_CCR2L_CCR13         TIM3_CCR2L_bit.CCR13
#define TIM3_CCR2L_CCR14         TIM3_CCR2L_bit.CCR14
#define TIM3_CCR2L_CCR15         TIM3_CCR2L_bit.CCR15
#define TIM3_CCR2L_CCR16         TIM3_CCR2L_bit.CCR16
#define TIM3_CCR2L_CCR17         TIM3_CCR2L_bit.CCR17

