yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al318a.h
#define DAC_DCH1LDHRL_LDHRL40    DAC_DCH1LDHRL_bit.LDHRL40
#define DAC_DCH1LDHRL_LDHRL50    DAC_DCH1LDHRL_bit.LDHRL50
#define DAC_DCH1LDHRL_LDHRL60    DAC_DCH1LDHRL_bit.LDHRL60
#define DAC_DCH1LDHRL_LDHRL70    DAC_DCH1LDHRL_bit.LDHRL70

#define DAC_DCH2LDHRH_LDHRH00    DAC_DCH2LDHRH_bit.LDHRH00
#define DAC_DCH2LDHRH_LDHRH10    DAC_DCH2LDHRH_bit.LDHRH10
#define DAC_DCH2LDHRH_LDHRH20    DAC_DCH2LDHRH_bit.LDHRH20
#define DAC_DCH2LDHRH_LDHRH30    DAC_DCH2LDHRH_bit.LDHRH30
#define DAC_DCH2LDHRH_LDHRH40    DAC_DCH2LDHRH_bit.LDHRH40
#define DAC_DCH2LDHRH_LDHRH50    DAC_DCH2LDHRH_bit.LDHRH50
#define DAC_DCH2LDHRH_LDHRH60    DAC_DCH2LDHRH_bit.LDHRH60
#define DAC_DCH2LDHRH_LDHRH70    DAC_DCH2LDHRH_bit.LDHRH70

#define DAC_DCH2LDHRL_LDHRL40    DAC_DCH2LDHRL_bit.LDHRL40
#define DAC_DCH2LDHRL_LDHRL50    DAC_DCH2LDHRL_bit.LDHRL50
#define DAC_DCH2LDHRL_LDHRL60    DAC_DCH2LDHRL_bit.LDHRL60
#define DAC_DCH2LDHRL_LDHRL70    DAC_DCH2LDHRL_bit.LDHRL70

#define DAC_DCH1DHR8_DHR00       DAC_DCH1DHR8_bit.DHR00
#define DAC_DCH1DHR8_DHR10       DAC_DCH1DHR8_bit.DHR10
#define DAC_DCH1DHR8_DHR20       DAC_DCH1DHR8_bit.DHR20
#define DAC_DCH1DHR8_DHR30       DAC_DCH1DHR8_bit.DHR30
#define DAC_DCH1DHR8_DHR40       DAC_DCH1DHR8_bit.DHR40
#define DAC_DCH1DHR8_DHR50       DAC_DCH1DHR8_bit.DHR50
#define DAC_DCH1DHR8_DHR60       DAC_DCH1DHR8_bit.DHR60
#define DAC_DCH1DHR8_DHR70       DAC_DCH1DHR8_bit.DHR70

#define DAC_DCH2DHR8_DHR00       DAC_DCH2DHR8_bit.DHR00
#define DAC_DCH2DHR8_DHR10       DAC_DCH2DHR8_bit.DHR10
#define DAC_DCH2DHR8_DHR20       DAC_DCH2DHR8_bit.DHR20
#define DAC_DCH2DHR8_DHR30       DAC_DCH2DHR8_bit.DHR30
#define DAC_DCH2DHR8_DHR40       DAC_DCH2DHR8_bit.DHR40
#define DAC_DCH2DHR8_DHR50       DAC_DCH2DHR8_bit.DHR50
#define DAC_DCH2DHR8_DHR60       DAC_DCH2DHR8_bit.DHR60
#define DAC_DCH2DHR8_DHR70       DAC_DCH2DHR8_bit.DHR70

#define DAC_CH1DORH_DORH00       DAC_CH1DORH_bit.DORH00
#define DAC_CH1DORH_DORH10       DAC_CH1DORH_bit.DORH10
#define DAC_CH1DORH_DORH20       DAC_CH1DORH_bit.DORH20
#define DAC_CH1DORH_DORH30       DAC_CH1DORH_bit.DORH30

#define DAC_CH1DORL_DORL00       DAC_CH1DORL_bit.DORL00
#define DAC_CH1DORL_DORL10       DAC_CH1DORL_bit.DORL10
#define DAC_CH1DORL_DORL20       DAC_CH1DORL_bit.DORL20
#define DAC_CH1DORL_DORL30       DAC_CH1DORL_bit.DORL30
#define DAC_CH1DORL_DORL40       DAC_CH1DORL_bit.DORL40
#define DAC_CH1DORL_DORL50       DAC_CH1DORL_bit.DORL50
#define DAC_CH1DORL_DORL60       DAC_CH1DORL_bit.DORL60
#define DAC_CH1DORL_DORL70       DAC_CH1DORL_bit.DORL70

#define DAC_CH2DORH_DORH00       DAC_CH2DORH_bit.DORH00
#define DAC_CH2DORH_DORH10       DAC_CH2DORH_bit.DORH10
#define DAC_CH2DORH_DORH20       DAC_CH2DORH_bit.DORH20
#define DAC_CH2DORH_DORH30       DAC_CH2DORH_bit.DORH30

#define DAC_CH2DORL_DORL00       DAC_CH2DORL_bit.DORL00
#define DAC_CH2DORL_DORL10       DAC_CH2DORL_bit.DORL10
#define DAC_CH2DORL_DORL20       DAC_CH2DORL_bit.DORL20
#define DAC_CH2DORL_DORL30       DAC_CH2DORL_bit.DORL30
#define DAC_CH2DORL_DORL40       DAC_CH2DORL_bit.DORL40
#define DAC_CH2DORL_DORL50       DAC_CH2DORL_bit.DORL50
#define DAC_CH2DORL_DORL60       DAC_CH2DORL_bit.DORL60
#define DAC_CH2DORL_DORL70       DAC_CH2DORL_bit.DORL70

#endif

/*-------------------------------------------------------------------------
 *      DAC bit masks
 *-----------------------------------------------------------------------*/
#define MASK_DAC_CH1CR1_EN       0x01
#define MASK_DAC_CH1CR1_BOFF     0x02
#define MASK_DAC_CH1CR1_TEN      0x04
#define MASK_DAC_CH1CR1_TSEL     0x38
#define MASK_DAC_CH1CR1_WAVEN    0xC0

#define MASK_DAC_CH1CR2_MAMP     0x0F
#define MASK_DAC_CH1CR2_DMAEN    0x10
#define MASK_DAC_CH1CR2_DMAUDRIE 0x20

#define MASK_DAC_CH2CR1_EN       0x01
#define MASK_DAC_CH2CR1_BOFF     0x02
#define MASK_DAC_CH2CR1_TEN      0x04
#define MASK_DAC_CH2CR1_TSEL     0x38
#define MASK_DAC_CH2CR1_WAVEN    0xC0

#define MASK_DAC_CH2CR2_MAMP     0x0F
#define MASK_DAC_CH2CR2_DMAEN    0x10
#define MASK_DAC_CH2CR2_DMAUDRIE 0x20

#define MASK_DAC_SWTRIG_SWTRIG1  0x01
#define MASK_DAC_SWTRIG_SWTRIG2  0x02

#define MASK_DAC_SR_DMAUDR1      0x01
#define MASK_DAC_SR_DMAUDR2      0x02

#define MASK_DAC_CH1RDHRH_RDHRH00 0x01
#define MASK_DAC_CH1RDHRH_RDHRH10 0x02
#define MASK_DAC_CH1RDHRH_RDHRH20 0x04
#define MASK_DAC_CH1RDHRH_RDHRH30 0x08

#define MASK_DAC_CH1RDHRL_RDHRL00 0x01
#define MASK_DAC_CH1RDHRL_RDHRL10 0x02
#define MASK_DAC_CH1RDHRL_RDHRL20 0x04
#define MASK_DAC_CH1RDHRL_RDHRL30 0x08
#define MASK_DAC_CH1RDHRL_RDHRL40 0x10
#define MASK_DAC_CH1RDHRL_RDHRL50 0x20
#define MASK_DAC_CH1RDHRL_RDHRL60 0x40
#define MASK_DAC_CH1RDHRL_RDHRL70 0x80

#define MASK_DAC_CH1LDHRH_LDHRH00 0x01
#define MASK_DAC_CH1LDHRH_LDHRH10 0x02
#define MASK_DAC_CH1LDHRH_LDHRH20 0x04
#define MASK_DAC_CH1LDHRH_LDHRH30 0x08
#define MASK_DAC_CH1LDHRH_LDHRH40 0x10
#define MASK_DAC_CH1LDHRH_LDHRH50 0x20
#define MASK_DAC_CH1LDHRH_LDHRH60 0x40
#define MASK_DAC_CH1LDHRH_LDHRH70 0x80

#define MASK_DAC_CH1LDHRL_LDHRL4 0x10
#define MASK_DAC_CH1LDHRL_LDHRL5 0x20
#define MASK_DAC_CH1LDHRL_LDHRL6 0x40
#define MASK_DAC_CH1LDHRL_LDHRL7 0x80

#define MASK_DAC_CH1DHR8_DHR00   0x01
#define MASK_DAC_CH1DHR8_DHR10   0x02
#define MASK_DAC_CH1DHR8_DHR20   0x04
#define MASK_DAC_CH1DHR8_DHR30   0x08
#define MASK_DAC_CH1DHR8_DHR40   0x10
#define MASK_DAC_CH1DHR8_DHR50   0x20
#define MASK_DAC_CH1DHR8_DHR60   0x40
#define MASK_DAC_CH1DHR8_DHR70   0x80

#define MASK_DAC_CH2RDHRH_RDHRH00 0x01
#define MASK_DAC_CH2RDHRH_RDHRH10 0x02
#define MASK_DAC_CH2RDHRH_RDHRH20 0x04
#define MASK_DAC_CH2RDHRH_RDHRH30 0x08

#define MASK_DAC_CH2RDHRL_RDHRL00 0x01
#define MASK_DAC_CH2RDHRL_RDHRL10 0x02
#define MASK_DAC_CH2RDHRL_RDHRL20 0x04
#define MASK_DAC_CH2RDHRL_RDHRL30 0x08
#define MASK_DAC_CH2RDHRL_RDHRL40 0x10
#define MASK_DAC_CH2RDHRL_RDHRL50 0x20
#define MASK_DAC_CH2RDHRL_RDHRL60 0x40
#define MASK_DAC_CH2RDHRL_RDHRL70 0x80

#define MASK_DAC_CH2LDHRH_LDHRH00 0x01
#define MASK_DAC_CH2LDHRH_LDHRH10 0x02
#define MASK_DAC_CH2LDHRH_LDHRH20 0x04
#define MASK_DAC_CH2LDHRH_LDHRH30 0x08
#define MASK_DAC_CH2LDHRH_LDHRH40 0x10
#define MASK_DAC_CH2LDHRH_LDHRH50 0x20
#define MASK_DAC_CH2LDHRH_LDHRH60 0x40
#define MASK_DAC_CH2LDHRH_LDHRH70 0x80

#define MASK_DAC_CH2LDHRL_LDHRL4 0x10
#define MASK_DAC_CH2LDHRL_LDHRL5 0x20
#define MASK_DAC_CH2LDHRL_LDHRL6 0x40
#define MASK_DAC_CH2LDHRL_LDHRL7 0x80

